; domain
(define (domain gripper-strips)
 (:requirements :strips :typing) 
 (:types room object robot gripper)
 (:predicates (at-robby ?r - robot ?x - room)
 	      (at ?o - object ?x - room)
	      (free ?r - robot ?g - gripper)
	      (carry ?r - robot ?o - object ?g - gripper))

   (:action move
       :parameters  (?r - robot ?from ?to - room)
       :precondition (and  (at-robby ?r ?from))
       :effect (and  (at-robby ?r ?to)
		     (not (at-robby ?r ?from))))

   (:action pick
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (at ?obj ?room) (at-robby ?r ?room) (free ?r ?g))
       :effect (and (carry ?r ?obj ?g)
		    (not (at ?obj ?room)) 
		    (not (free ?r ?g))))

   (:action drop
       :parameters (?r - robot ?obj - object ?room - room ?g - gripper)
       :precondition  (and  (carry ?r ?obj ?g) (at-robby ?r ?room))
       :effect (and (at ?obj ?room)
		    (free ?r ?g)
		    (not (carry ?r ?obj ?g)))))

; problem
(define (problem gripper-2-18-16)
(:domain gripper-strips)
(:objects robot1 robot2 - robot
rgripper1 lgripper1 rgripper2 lgripper2 - gripper
room1 room2 room3 room4 room5 room6 room7 room8 room9 room10 room11 room12 room13 room14 room15 room16 room17 room18 - room
ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 - object)
(:init
(at-robby robot1 room17)
(free robot1 rgripper1)
(free robot1 lgripper1)
(at-robby robot2 room11)
(free robot2 rgripper2)
(free robot2 lgripper2)
(at ball1 room12)
(at ball2 room10)
(at ball3 room7)
(at ball4 room17)
(at ball5 room13)
(at ball6 room12)
(at ball7 room4)
(at ball8 room16)
(at ball9 room18)
(at ball10 room12)
(at ball11 room8)
(at ball12 room10)
(at ball13 room8)
(at ball14 room6)
(at ball15 room13)
(at ball16 room8)
)
(:goal
(and
(at ball1 room13)
(at ball2 room5)
(at ball3 room16)
(at ball4 room4)
(at ball5 room5)
(at ball6 room7)
(at ball7 room12)
(at ball8 room15)
(at ball9 room3)
(at ball10 room13)
(at ball11 room7)
(at ball12 room18)
(at ball13 room17)
(at ball14 room6)
(at ball15 room11)
(at ball16 room10)
)
)
)

; plan
1. (pick robot1 ball4 room17 lgripper1)
   deleted: (at ball4 room17) (free robot1 lgripper1)
   added: (carry robot1 ball4 lgripper1)
   goals met: 1 of 16
2. (move robot2 room11 room8)
   deleted: (at-robby robot2 room11)
   added: (at-robby robot2 room8)
   goals met: 1 of 16
3. (move robot1 room17 room4)
   deleted: (at-robby robot1 room17)
   added: (at-robby robot1 room4)
   goals met: 1 of 16
4. (pick robot2 ball16 room8 lgripper2)
   deleted: (at ball16 room8) (free robot2 lgripper2)
   added: (carry robot2 ball16 lgripper2)
   goals met: 1 of 16
5. (pick robot2 ball13 room8 rgripper2)
   deleted: (at ball13 room8) (free robot2 rgripper2)
   added: (carry robot2 ball13 rgripper2)
   goals met: 1 of 16
6. (drop robot1 ball4 room4 lgripper1)
   deleted: (carry robot1 ball4 lgripper1)
   added: (at ball4 room4) (free robot1 lgripper1)
   goals met: 2 of 16
7. (pick robot1 ball7 room4 rgripper1)
   deleted: (at ball7 room4) (free robot1 rgripper1)
   added: (carry robot1 ball7 rgripper1)
   goals met: 2 of 16
8. (move robot2 room8 room17)
   deleted: (at-robby robot2 room8)
   added: (at-robby robot2 room17)
   goals met: 2 of 16
9. (move robot1 room4 room12)
   deleted: (at-robby robot1 room4)
   added: (at-robby robot1 room12)
   goals met: 2 of 16
10. (drop robot2 ball13 room17 rgripper2)
   deleted: (carry robot2 ball13 rgripper2)
   added: (at ball13 room17) (free robot2 rgripper2)
   goals met: 3 of 16
11. (drop robot1 ball7 room12 rgripper1)
   deleted: (carry robot1 ball7 rgripper1)
   added: (at ball7 room12) (free robot1 rgripper1)
   goals met: 4 of 16
12. (move robot2 room17 room8)
   deleted: (at-robby robot2 room17)
   added: (at-robby robot2 room8)
   goals met: 4 of 16
13. (pick robot1 ball6 room12 lgripper1)
   deleted: (at ball6 room12) (free robot1 lgripper1)
   added: (carry robot1 ball6 lgripper1)
   goals met: 4 of 16
14. (pick robot2 ball11 room8 rgripper2)
   deleted: (at ball11 room8) (free robot2 rgripper2)
   added: (carry robot2 ball11 rgripper2)
   goals met: 4 of 16
15. (move robot1 room12 room7)
   deleted: (at-robby robot1 room12)
   added: (at-robby robot1 room7)
   goals met: 4 of 16
16. (move robot2 room8 room7)
   deleted: (at-robby robot2 room8)
   added: (at-robby robot2 room7)
   goals met: 4 of 16
17. (drop robot1 ball6 room7 lgripper1)
   deleted: (carry robot1 ball6 lgripper1)
   added: (at ball6 room7) (free robot1 lgripper1)
   goals met: 5 of 16
18. (pick robot1 ball3 room7 rgripper1)
   deleted: (at ball3 room7) (free robot1 rgripper1)
   added: (carry robot1 ball3 rgripper1)
   goals met: 5 of 16
19. (drop robot2 ball11 room7 rgripper2)
   deleted: (carry robot2 ball11 rgripper2)
   added: (at ball11 room7) (free robot2 rgripper2)
   goals met: 6 of 16
20. (move robot1 room7 room10)
   deleted: (at-robby robot1 room7)
   added: (at-robby robot1 room10)
   goals met: 6 of 16
21. (move robot2 room7 room10)
   deleted: (at-robby robot2 room7)
   added: (at-robby robot2 room10)
   goals met: 6 of 16
22. (pick robot1 ball2 room10 lgripper1)
   deleted: (at ball2 room10) (free robot1 lgripper1)
   added: (carry robot1 ball2 lgripper1)
   goals met: 6 of 16
23. (drop robot2 ball16 room10 lgripper2)
   deleted: (carry robot2 ball16 lgripper2)
   added: (at ball16 room10) (free robot2 lgripper2)
   goals met: 7 of 16
24. (move robot1 room10 room5)
   deleted: (at-robby robot1 room10)
   added: (at-robby robot1 room5)
   goals met: 7 of 16
25. (pick robot2 ball12 room10 rgripper2)
   deleted: (at ball12 room10) (free robot2 rgripper2)
   added: (carry robot2 ball12 rgripper2)
   goals met: 7 of 16
26. (move robot2 room10 room5)
   deleted: (at-robby robot2 room10)
   added: (at-robby robot2 room5)
   goals met: 7 of 16
27. (drop robot1 ball2 room5 lgripper1)
   deleted: (carry robot1 ball2 lgripper1)
   added: (at ball2 room5) (free robot1 lgripper1)
   goals met: 8 of 16
28. (move robot1 room5 room16)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room16)
   goals met: 8 of 16
29. (move robot2 room5 room18)
   deleted: (at-robby robot2 room5)
   added: (at-robby robot2 room18)
   goals met: 8 of 16
30. (drop robot1 ball3 room16 rgripper1)
   deleted: (carry robot1 ball3 rgripper1)
   added: (at ball3 room16) (free robot1 rgripper1)
   goals met: 9 of 16
31. (pick robot1 ball8 room16 lgripper1)
   deleted: (at ball8 room16) (free robot1 lgripper1)
   added: (carry robot1 ball8 lgripper1)
   goals met: 9 of 16
32. (drop robot2 ball12 room18 rgripper2)
   deleted: (carry robot2 ball12 rgripper2)
   added: (at ball12 room18) (free robot2 rgripper2)
   goals met: 10 of 16
33. (pick robot2 ball9 room18 lgripper2)
   deleted: (at ball9 room18) (free robot2 lgripper2)
   added: (carry robot2 ball9 lgripper2)
   goals met: 10 of 16
34. (move robot1 room16 room15)
   deleted: (at-robby robot1 room16)
   added: (at-robby robot1 room15)
   goals met: 10 of 16
35. (move robot2 room18 room3)
   deleted: (at-robby robot2 room18)
   added: (at-robby robot2 room3)
   goals met: 10 of 16
36. (drop robot1 ball8 room15 lgripper1)
   deleted: (carry robot1 ball8 lgripper1)
   added: (at ball8 room15) (free robot1 lgripper1)
   goals met: 11 of 16
37. (drop robot2 ball9 room3 lgripper2)
   deleted: (carry robot2 ball9 lgripper2)
   added: (at ball9 room3) (free robot2 lgripper2)
   goals met: 12 of 16
38. (move robot1 room15 room5)
   deleted: (at-robby robot1 room15)
   added: (at-robby robot1 room5)
   goals met: 12 of 16
39. (move robot2 room3 room5)
   deleted: (at-robby robot2 room3)
   added: (at-robby robot2 room5)
   goals met: 12 of 16
40. (move robot1 room5 room12)
   deleted: (at-robby robot1 room5)
   added: (at-robby robot1 room12)
   goals met: 12 of 16
41. (move robot2 room5 room13)
   deleted: (at-robby robot2 room5)
   added: (at-robby robot2 room13)
   goals met: 12 of 16
42. (pick robot1 ball10 room12 lgripper1)
   deleted: (at ball10 room12) (free robot1 lgripper1)
   added: (carry robot1 ball10 lgripper1)
   goals met: 12 of 16
43. (pick robot1 ball1 room12 rgripper1)
   deleted: (at ball1 room12) (free robot1 rgripper1)
   added: (carry robot1 ball1 rgripper1)
   goals met: 12 of 16
44. (pick robot2 ball5 room13 lgripper2)
   deleted: (at ball5 room13) (free robot2 lgripper2)
   added: (carry robot2 ball5 lgripper2)
   goals met: 12 of 16
45. (pick robot2 ball15 room13 rgripper2)
   deleted: (at ball15 room13) (free robot2 rgripper2)
   added: (carry robot2 ball15 rgripper2)
   goals met: 12 of 16
46. (move robot2 room13 room5)
   deleted: (at-robby robot2 room13)
   added: (at-robby robot2 room5)
   goals met: 12 of 16
47. (move robot1 room12 room13)
   deleted: (at-robby robot1 room12)
   added: (at-robby robot1 room13)
   goals met: 12 of 16
48. (drop robot1 ball10 room13 lgripper1)
   deleted: (carry robot1 ball10 lgripper1)
   added: (at ball10 room13) (free robot1 lgripper1)
   goals met: 13 of 16
49. (drop robot1 ball1 room13 rgripper1)
   deleted: (carry robot1 ball1 rgripper1)
   added: (at ball1 room13) (free robot1 rgripper1)
   goals met: 14 of 16
50. (drop robot2 ball5 room5 lgripper2)
   deleted: (carry robot2 ball5 lgripper2)
   added: (at ball5 room5) (free robot2 lgripper2)
   goals met: 15 of 16
51. (move robot2 room5 room11)
   deleted: (at-robby robot2 room5)
   added: (at-robby robot2 room11)
   goals met: 15 of 16
52. (drop robot2 ball15 room11 rgripper2)
   deleted: (carry robot2 ball15 rgripper2)
   added: (at ball15 room11) (free robot2 rgripper2)
   goals met: 16 of 16
